--
-- PostgreSQL database dump
--

-- Dumped from database version 17.4
-- Dumped by pg_dump version 17.4

-- Started on 2025-10-13 12:33:04

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- TOC entry 4848 (class 0 OID 16391)
-- Dependencies: 218
-- Data for Name: users; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.users (id, username, email, password_hash, created_at, role, full_name, phone_number, city, education, bio, avatar_url) FROM stdin;
7	admin	admin@gmail.com	$2a$12$7g8ga2zfHrpr46DQCGMCuui4WAaBpE6v3gRRX6vUk4Ah/nvUCMPeW	2025-05-24 11:12:44.378563	admin	Дудина Анастасия Андреевна	89805447999	Воронеж	ВГТУ колледж	Админ	https://lecture-note.onrender.com5001/uploads/1748076163908-7013225-Ð·Ð°Ð³ÑÑÐ·ÐºÐ°.jfif
8	victoria	victoria@gmail.com	$2b$10$yxXSnKU9rSK6OGF0T2e34udVGzGjAgACRMh16gj.Oi46JE9.a7JxK	2025-05-24 12:30:06.457728	student	\N	\N	\N	\N	\N	\N
9	artem	artem@gmail.com	$2b$10$egZDauxycTd81JLsup9X/uhcflyF.x6qITuLLNOqXWNi/bvc4icZ2	2025-05-24 12:35:48.342415	student	\N	\N	\N	\N	\N	\N
2	deemure	deemure@gmail.com	$2b$10$efI4wOv7X4mk2SgtJMLVb.QX0.YTaXedVijMu1WfYrxgtLviKrnDW	2025-05-07 12:37:02.144433	student	Братчикова Виктория Анатольевна	88005553535	Воронеж	ВГЛТУ		https://lecture-note.onrender.com5001/uploads/1747906367628-16927639-8. ÐÐ¾Ð¶ÑÑ ÐºÐ¾ÑÐ¾Ð²ÐºÐ°.jpg
6	fedorov	fedorov@gmail.com	$2b$10$x5R4vzlYlg.819AXAOHNsO9/rTGBcWgO5R0QrNnq3BfiL1YCHHwpu	2025-05-22 13:48:54.848652	teacher	\N	\N	\N	\N	\N	https://lecture-note.onrender.com5001/uploads/1749990405810-659225300-3. ÐÐµÐ¾Ð¿Ð°ÑÐ´.jpg
1	ttwinkleee	ttwinkleee@gmail.com	$2b$10$hfIQ5Sbs1.lffFh5dO9s2OtgjlxIUebBU4IRAFwN6.Nmjl0LpXGry	2025-05-07 12:32:59.328213	student	Дудина Анастасия Андреевна	89805447999	Воронеж	ВГТУ колледж	Программист	https://lecture-note.onrender.com5001/uploads/1747863274419-734806136-Ð·Ð°Ð³ÑÑÐ·ÐºÐ°.jfif
5	mxdnights	mxdnights@gmail.com	$2b$10$cCSxJ3Wv.hPSB9Q4srsBsOpOAquPKCZjEqxNeFVqJ5l98hcBhpTFW	2025-05-22 11:13:20.989303	teacher	Кириченко Максим Романович	89204567892	Воронеж	ВГТУ колледж	Программист	https://lecture-note.onrender.com5001/uploads/1747901654488-25417149-6. ÐÐ¸ÑÐ°Ñ.jpg
3	fercuerro	fercuerro@gmail.com	$2b$10$HjaeTpLldkXzXolsehvpQePgvK.y49MwTVf/KsrgF4pfp6jVx6T8u	2025-05-07 12:51:00.124552	teacher	Дмитриев Владимир Романович	89204480271	Воронеж	ВГТУ колледж	Программист	https://lecture-note.onrender.com5001/uploads/1747898111110-818719263-5. ÐÐµÐ»ÑÐ¹ ÑÐ¸Ð³ÑÐµÐ½Ð¾Ðº.jpg
\.


--
-- TOC entry 4855 (class 0 OID 16978)
-- Dependencies: 225
-- Data for Name: tutors; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.tutors (id, user_id, full_name, subject, price, available_days, available_time, additional_info, "position", education, rank, city, created_at) FROM stdin;
2	3	Дмитриев Владимир Романович	Информатика	2400	{Пн,Вт,Ср,Пт}	{"end": "18:00", "start": "09:00"}	Стаж работы 22 года	Профессор	Высшее образование	Кандидат наук	Воронеж	2025-05-23 20:15:50.201026
1	5	Кириченко Максим Романович	Физика	2300	{Пн,Ср,Пт,Вс}	{"end": "18:00", "start": "09:00"}	Стаж работы 20 лет	Профессор	Высшее образование	Кандидат наук	Воронеж	2025-05-23 20:14:50.826839
\.


--
-- TOC entry 4859 (class 0 OID 17035)
-- Dependencies: 229
-- Data for Name: bookings; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.bookings (id, student_id, tutor_id, datetime, created_at) FROM stdin;
1	1	2	2025-05-26 11:00:00	2025-05-23 20:26:10.215022
2	1	2	2025-05-26 12:00:00	2025-05-23 20:28:00.499715
3	1	1	2025-05-26 14:00:00	2025-05-23 20:37:50.322299
4	1	1	2025-05-28 17:00:00	2025-05-23 20:37:55.418377
5	2	2	2025-05-27 14:00:00	2025-05-23 20:38:15.680739
6	2	1	2025-05-26 15:00:00	2025-05-23 20:38:21.360269
7	1	2	2025-05-27 11:00:00	2025-05-23 20:38:34.812717
8	1	2	2025-05-23 16:00:00	2025-05-23 20:39:43.005214
9	1	1	2025-05-25 14:00:00	2025-05-23 20:40:48.012354
10	1	1	2025-05-25 13:00:00	2025-05-24 12:10:06.003024
11	1	2	2025-05-28 11:00:00	2025-05-24 12:38:56.37812
12	1	1	2025-06-23 11:00:00	2025-06-07 17:45:02.924914
\.


--
-- TOC entry 4850 (class 0 OID 16403)
-- Dependencies: 220
-- Data for Name: notes; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.notes (id, user_id, title, text, created_at, updated_at) FROM stdin;
4	3	lala	Договор на оказание услуг\n\nФИО заказчика: Коновалов, Иван, Константинович\nТелефон: 88005553535\nНаименование программы: Язык C#\nКвалификация: Программирование\nСтоимость: 15000\nДата: 21.05.2025	2025-05-21 15:35:40.064452	\N
8	1	История	Ишкишмуик	2025-06-15 14:41:22.703235	\N
9	1	Высшая математика	Тшукишаси3цу	2025-06-15 14:41:44.393901	\N
10	1	Английский язык	Оимаиукмшдику	2025-06-15 14:42:02.349761	\N
11	1	Философия	Км укимуимолуки	2025-06-15 14:42:08.541455	\N
12	1	Менеджмент в проффесиональной деятельности	Тстушдстц	2025-06-15 14:42:47.790089	\N
13	1	Проектированеи бд	Шшсцутшстцуштм	2025-06-15 14:44:45.368738	\N
14	1	Разработка программных модулей	Тдамтошутокм у	2025-06-15 14:45:11.964444	\N
15	1	Разработка программных модулей	С  вс во смоу муы	2025-06-15 14:45:38.590524	\N
16	1	Компьютерные сети	Компьютерная сеть — это единый комплекс, где компьютеры, серверы и другая техника взаимодействуют посредством каналов связи. Назначение этого ансамбля состоит в упрощении и облегчении IT-процессов и ускорении работы. Пользователи получают совместный доступ к аппаратному и программному обеспечению, а также информационным ресурсам. В нашей статье мы расскажем о разновидностях компьютерных сетей и принципах их формирования.\n\nКомпьютеры в организации\nТипы компьютерных сетей\nДля объединения компьютеров в систему обращают внимание на следующие параметры:\n\nразновидность машин;\nрасстояние между оборудованием;\nвозложенные на комплекс функции.\nДаже если соединить пару компьютеров, это уже будет считаться сетью. У последней есть 2 задачи, которые она может выполнять по отдельности или обе сразу. Это — передача информации между системами либо предоставление доступа к общим ресурсам (серверам, принтерам, БД). Элементы сети связывают друг с другом посредством физического (проводами или радиоволнами) и логического (конкретными сетевыми протоколами) соединения.\n\nКаждый вид компьютерных сетей был создан для определенной области применения, поэтому в отношении их действуют различные стандарты и методы. Соответственно, отдельный тип имеет свои недостатки и преимущества. Рассмотрим эти разновидности подробнее.\n\nPAN — персональная сеть\nPAN — Personal Area Network. Это объединение персонального пользовательского оборудования. В один комплекс собирают смартфоны, КПК, наушники, камеры, игровые консоли, ноутбуки и тД., используя связь по Wi-Fi, Bluetooth, USB. Умные дома функционируют на основе протоколов ZigBee, Insteon, Z-Wave. PAN и WPAN (беспроводной вариант) имеют радиус действия, ограниченный 30 метрами, и могут обеспечить связью до 8 абонентов. Поэтому такие соединения нельзя использовать в разных зданиях. Но посредством персональной сети возможно подключиться к более крупным объединениям.\n\nLAN — локальная сеть\nLAN — локальная сеть\nLAN — Local Area Network. К этой локальной сети можно подключить множество устройств. Радиус охвата составляет до 2 км, скорость обмена информацией — до 10000 Мбит&amp;#x2F;с.\n\nLAN обычно используют в частных домах, административных зданиях, образовательных учреждениях и других местах, где требуется объединить в один комплекс технику для быстрой передачи информации и общего доступа к серверам, печатающим устройствам, программному обеспечению. Кабельное подключение реализуют через технологию Ethernet, беспроводное — Wi-Fi. В последнем случае система называется WLAN,  Wireless Local Area Network, и действует на основе стандарта IEEE 802.11. Она позволяет абонентам сохранять подключение к локальной сети при передвижении по территории, охватываемой сигналом.\n\nУстройства, составляющие LAN или WLAN, свободно могут подключаться к интернету. Если в ЛВС (локальной вычислительной сети) подключено 2 и более компьютера, то в системе необходимо иметь также узлы и элементы, обеспечивающие стабильную связь — мосты, концентраторы, коммутаторы. Охват LAN можно увеличить за счет использования повторителей сигнала (ретрансляторов). Но обычно ЛВС используют в одном здании. WLAN популярны для установки дома или в организациях, где Wi-Fi раздают сотрудникам и посетителям. Главная отличительная черта ЛВС — скорость и качество связи на коротких расстояниях. LAN возможно подключить к более обширным MAN или WAN.\n\nCAN — кампусная сеть\nCAN — Campus Area Network. Это объединение нескольких ЛВС. Обычно используют в комплексе зданий, находящихся на расстоянии друг от друга (корпусы больниц, институтов, общежития учебных заведений и тД.). ЛВС всех корпусов связаны между собой либо оптоволоконным кабелем, либо антеннами WiMAX, E-Band.\n\nMAN — региональная (столичная, городская) сеть\nMAN — Metropolitan Area. Связывает в одну компьютерную систему ближайшие ЛВС. Для обеспечения высокой скорости передачи данных между устройствами (расстояние между которыми может составлять десятки км) используют высокоэффективные маршрутизаторы и соединение по оптическому волокну. Особые возможности предоставляет абонентам беспроводная сеть WMAN. С помощью технологии WiMAX работают телеканалы и радиостанции, точки Wi-Fi Hotspot, где к городской сети или интернету могут подключиться все желающие (посетители кафе, коворкинг-центров и тД.). Также к WMAN присоединяются жители, которые не могут использовать DSL (подключение по стационарной телефонной линии).\n\nWAN — глобальная сеть\nWAN — Wide Area Network. Если столичные сети связывают узлы, действующие в районах или городах, то глобальные объединяют неограниченное количество устройств в целых странах и на материках. Использовать для этого кабели Ethernet невозможно в связи с огромными расстояниями, поэтому WAN применяет другие технологии: SDH, IP&amp;#x2F; MPLS, ATM, PDH, SONET. Чтобы обеспечить стабильность функционирования глобальных сетей, используют более сложные способы и аппаратное обеспечение, чем при работе ЛВС.\n\nWAN принадлежат конкретным компаниям. Провайдеры арендуют их и подключают к интернету конечных пользователей или ЛВС.\n\nGAN — глобальная зональная сеть\nGAN — Globe Area Network. Яркой иллюстрацией является Интернет. Но вместе с этим есть организации, которые владеют сетями, закрытыми для общего доступа. Они состоят из нескольких WAN, благодаря чему фирма-собственник может объединить свои компьютеры, разбросанные по всему миру. Для соединения применяют оптоволоконные инфраструктуры, а также кабели, идущие по дну океанов, или спутниковые сигналы.\n\nVPN — виртуальная частная сеть\nVPN — Virtual Private Network. Это виртуальный канал, соединяющий клиента с сервером. Действует на основе любой из физических сетей, о которых шла речь выше. VPN дает доступ практически к каждому устройству в любой точке мира. Система бесплатна, в отличие от частных WAN или MAN. VPN используют для того, чтобы объединить несколько ЛВС в интернете или разрешить удаленный доступ через обычное подключение. Для сохранности конфиденциальных данных эта сеть применяет технологии шифрования. Белее подробнее о VPN читайте здесь\n\nBAN — нательная сеть\nBAN — нательная компьютерная сеть. Объединяет внешние и&amp;#x2F; или имплантированные устройства: умные кардиологические стимуляторы и часы, пульсометры, мониторы АД и тД. Главная задача BAN состоит в обеспечении устойчивой и бесперебойной связи измерительных приборов.\n\nПринципы построения компьютерных сетей\nВсе современные организации строят свои компьютерные сети по одному из принципов, описанных ниже. Выбор определенного вида физической связи устройств друг с другом оказывает влияние на свойства системы.\n\nЛиния\nСхема построения &amp;quot;Линия&amp;quot;\nВсе абоненты размещаются на одной линии. При выходе из строя либо отключении одного компьютера перестает функционировать вся система. Данный принцип построения ЛВС почти не применяют, тКОн несовершенен и уже морально устарел.\n\nШина\nСхема построения &amp;quot;Шина&amp;quot;\nК одному кабелю (шине) с помощью Т-коннекторов подключены компьютеры. На концах шины установлены терминаторы — заглушки, которые препятствуют отражению сигнала и обеспечивают его чистоту. Сеть функционирует следующим образом. Все компьютеры одновременно принимают и анализируют сигнал, посланный одним из участников. Устройство, которому адресована информация, начинает его обрабатывать.\n\nПреимущества такой схемы:\n\nКаждый компьютер, прежде чем передавать данные, проверяет, есть ли в шине сигнал (это исключает коллизии).\nСистему легко и просто смонтировать и настроить.\nЭкономится кабель (в сравнении с другими видами компьютерных сетей).\nВыход из строя одного устройства не влияет на деятельность сети.\nК недостаткам относятся низкая скорость работы системы при подключении большого количества компьютеров и потеря соединения одновременно всеми абонентами в результате повреждений шины.\n\nКольцо\nСхема построения &amp;quot;Кольцо&amp;quot;\nЭта топология похожа на принцип линии, но здесь компьютеры соединяются друг с другом последовательно в кольцо. Сигнал идет только в одну сторону. Если необходимо посылать информацию в обратном направлении, создают двойное кольцо. Компьютер принимает данные от предыдущего абонента и проводит анализ. Если информация направлялась ему, он ее обрабатывает, если нет — отправляет следующему участнику.\n\nСистему легко смонтировать из минимума оборудования. Сеть, сформированная по принципу кольца, обладает более высокой скоростью передачи информации (по сравнению с линейной топологией) и устойчивостью. Она способна объединить до 1000 устройств. Но, если в какой-либо части кольца пропадает сигнал, система полностью перестает работать.\n\nМногосвязная\nСхема построения &amp;quot;Многосвязная&amp;quot;\nЭта топология позволяет обмениваться данными на высокой скорости. Плюс при выходе из строя одного из элементов сети вся система продолжает функционировать, и остальные участники не испытывают дискомфорта при работе. Такая конфигурация применяется редко, так как является недешевым удовольствием. Обычно ее используют стратегические объекты, которым важна высокоскоростная и надежная работа системы.\n\nЗвезда\nСхема построения &amp;quot;Звезда&amp;quot;\nВ этой схеме действует центральный коммутатор либо свитч (хаб), к которому по отдельности на расстоянии не более 100 м подключен каждый компьютер. Топология «звезда» считается самой оптимальной для формирования сети благодаря следующим преимуществам:\n\nминимум кабеля и дополнительных инструментов соединения;\nнадежная работа в условиях высокой нагрузки;\nбесперебойное функционирование системы при выходе из строя одного из компьютеров или канала связи.\nЕстественно, если перестанет работать хаб, все участники системы потеряют соединение.	2025-06-15 14:56:05.609598	\N
17	2	Экономика отрасли	Иквеирвекор	2025-06-15 14:59:19.680515	\N
18	2	Философия	Акуитсицулмситыцу	2025-06-15 14:59:27.259179	\N
19	2	Правовое обеспечение трудовой деятельности	Еиентоеаьпрьрпе	2025-06-15 14:59:54.540857	\N
21	2	Компьютерные сети	Компьютерные сети\n\nКомпьютерная сеть — это единый комплекс, где компьютеры, серверы и другая техника взаимодействуют посредством каналов связи. Назначение этого ансамбля состоит в упрощении и облегчении IT-процессов и ускорении работы. Пользователи получают совместный доступ к аппаратному и программному обеспечению, а также информационным ресурсам. В нашей статье мы расскажем о разновидностях компьютерных сетей и принципах их формирования.\n\nКомпьютеры в организации\n\nТипы компьютерных сетей\n\nДля объединения компьютеров в систему обращают внимание на следующие параметры:\n\nразновидность машин;\n\nрасстояние между оборудованием;\n\nвозложенные на комплекс функции.\n\nДаже если соединить пару компьютеров, это уже будет считаться сетью. У последней есть 2 задачи, которые она может выполнять по отдельности или обе сразу. Это — передача информации между системами либо предоставление доступа к общим ресурсам (серверам, принтерам, БД). Элементы сети связывают друг с другом посредством физического (проводами или радиоволнами) и логического (конкретными сетевыми протоколами) соединения.\n\nКаждый вид компьютерных сетей был создан для определенной области применения, поэтому в отношении их действуют различные стандарты и методы. Соответственно, отдельный тип имеет свои недостатки и преимущества. Рассмотрим эти разновидности подробнее.\n\nPAN — персональная сеть\n\nPAN — Personal Area Network. Это объединение персонального пользовательского оборудования. В один комплекс собирают смартфоны, КПК, наушники, камеры, игровые консоли, ноутбуки и тД., используя связь по Wi-Fi, Bluetooth, USB. Умные дома функционируют на основе протоколов ZigBee, Insteon, Z-Wave. PAN и WPAN (беспроводной вариант) имеют радиус действия, ограниченный 30 метрами, и могут обеспечить связью до 8 абонентов. Поэтому такие соединения нельзя использовать в разных зданиях. Но посредством персональной сети возможно подключиться к более крупным объединениям.\n\nLAN — локальная сеть\n\nLAN — локальная сеть\n\nLAN — Local Area Network. К этой локальной сети можно подключить множество устройств. Радиус охвата составляет до 2 км, скорость обмена информацией — до 10000 Мбит&amp;amp;amp;amp;#x2F;с.\n\nLAN обычно используют в частных домах, административных зданиях, образовательных учреждениях и других местах, где требуется объединить в один комплекс технику для быстрой передачи информации и общего доступа к серверам, печатающим устройствам, программному обеспечению. Кабельное подключение реализуют через технологию Ethernet, беспроводное — Wi-Fi. В последнем случае система называется WLAN,  Wireless Local Area Network, и действует на основе стандарта IEEE 802.11. Она позволяет абонентам сохранять подключение к локальной сети при передвижении по территории, охватываемой сигналом.\n\nУстройства, составляющие LAN или WLAN, свободно могут подключаться к интернету. Если в ЛВС (локальной вычислительной сети) подключено 2 и более компьютера, то в системе необходимо иметь также узлы и элементы, обеспечивающие стабильную связь — мосты, концентраторы, коммутаторы. Охват LAN можно увеличить за счет использования повторителей сигнала (ретрансляторов). Но обычно ЛВС используют в одном здании. WLAN популярны для установки дома или в организациях, где Wi-Fi раздают сотрудникам и посетителям. Главная отличительная черта ЛВС — скорость и качество связи на коротких расстояниях. LAN возможно подключить к более обширным MAN или WAN.\n\nCAN — кампусная сеть\n\nCAN — Campus Area Network. Это объединение нескольких ЛВС. Обычно используют в комплексе зданий, находящихся на расстоянии друг от друга (корпусы больниц, институтов, общежития учебных заведений и тД.). ЛВС всех корпусов связаны между собой либо оптоволоконным кабелем, либо антеннами WiMAX, E-Band.\n\nMAN — региональная (столичная, городская) сеть\n\nMAN — Metropolitan Area. Связывает в одну компьютерную систему ближайшие ЛВС. Для обеспечения высокой скорости передачи данных между устройствами (расстояние между которыми может составлять десятки км) используют высокоэффективные маршрутизаторы и соединение по оптическому волокну. Особые возможности предоставляет абонентам беспроводная сеть WMAN. С помощью технологии WiMAX работают телеканалы и радиостанции, точки Wi-Fi Hotspot, где к городской сети или интернету могут подключиться все желающие (посетители кафе, коворкинг-центров и тД.). Также к WMAN присоединяются жители, которые не могут использовать DSL (подключение по стационарной телефонной линии).\n\nWAN — глобальная сеть\n\nWAN — Wide Area Network. Если столичные сети связывают узлы, действующие в районах или городах, то глобальные объединяют неограниченное количество устройств в целых странах и на материках. Использовать для этого кабели Ethernet невозможно в связи с огромными расстояниями, поэтому WAN применяет другие технологии: SDH, IP&amp;amp;amp;amp;#x2F; MPLS, ATM, PDH, SONET. Чтобы обеспечить стабильность функционирования глобальных сетей, используют более сложные способы и аппаратное обеспечение, чем при работе ЛВС.\n\nWAN принадлежат конкретным компаниям. Провайдеры арендуют их и подключают к интернету конечных пользователей или ЛВС.\n\nGAN — глобальная зональная сеть\n\nGAN — Globe Area Network. Яркой иллюстрацией является Интернет. Но вместе с этим есть организации, которые владеют сетями, закрытыми для общего доступа. Они состоят из нескольких WAN, благодаря чему фирма-собственник может объединить свои компьютеры, разбросанные по всему миру. Для соединения применяют оптоволоконные инфраструктуры, а также кабели, идущие по дну океанов, или спутниковые сигналы.\n\nVPN — виртуальная частная сеть\n\nVPN — Virtual Private Network. Это виртуальный канал, соединяющий клиента с сервером. Действует на основе любой из физических сетей, о которых шла речь выше. VPN дает доступ практически к каждому устройству в любой точке мира. Система бесплатна, в отличие от частных WAN или MAN. VPN используют для того, чтобы объединить несколько ЛВС в интернете или разрешить удаленный доступ через обычное подключение. Для сохранности конфиденциальных данных эта сеть применяет технологии шифрования. Белее подробнее о VPN читайте здесь\n\nBAN — нательная сеть\n\nBAN — нательная компьютерная сеть. Объединяет внешние и&amp;amp;amp;amp;#x2F; или имплантированные устройства: умные кардиологические стимуляторы и часы, пульсометры, мониторы АД и тД. Главная задача BAN состоит в обеспечении устойчивой и бесперебойной связи измерительных приборов.\n\nПринципы построения компьютерных сетей\n\nВсе современные организации строят свои компьютерные сети по одному из принципов, описанных ниже. Выбор определенного вида физической связи устройств друг с другом оказывает влияние на свойства системы.\n\nЛиния\n\nСхема построения &amp;amp;amp;amp;quot;Линия&amp;amp;amp;amp;quot;\n\nВсе абоненты размещаются на одной линии. При выходе из строя либо отключении одного компьютера перестает функционировать вся система. Данный принцип построения ЛВС почти не применяют, тКОн несовершенен и уже морально устарел.\n\nШина\n\nСхема построения &amp;amp;amp;amp;quot;Шина&amp;amp;amp;amp;quot;\n\nК одному кабелю (шине) с помощью Т-коннекторов подключены компьютеры. На концах шины установлены терминаторы — заглушки, которые препятствуют отражению сигнала и обеспечивают его чистоту. Сеть функционирует следующим образом. Все компьютеры одновременно принимают и анализируют сигнал, посланный одним из участников. Устройство, которому адресована информация, начинает его обрабатывать.\n\nПреимущества такой схемы:\n\nКаждый компьютер, прежде чем передавать данные, проверяет, есть ли в шине сигнал (это исключает коллизии).\n\nСистему легко и просто смонтировать и настроить.\n\nЭкономится кабель (в сравнении с другими видами компьютерных сетей).\n\nВыход из строя одного устройства не влияет на деятельность сети.\n\nК недостаткам относятся низкая скорость работы системы при подключении большого количества компьютеров и потеря соединения одновременно всеми абонентами в результате повреждений шины.\n\nКольцо\n\nСхема построения &amp;amp;amp;amp;quot;Кольцо&amp;amp;amp;amp;quot;\n\nЭта топология похожа на принцип линии, но здесь компьютеры соединяются друг с другом последовательно в кольцо. Сигнал идет только в одну сторону. Если необходимо посылать информацию в обратном направлении, создают двойное кольцо. Компьютер принимает данные от предыдущего абонента и проводит анализ. Если информация направлялась ему, он ее обрабатывает, если нет — отправляет следующему участнику.\n\nСистему легко смонтировать из минимума оборудования. Сеть, сформированная по принципу кольца, обладает более высокой скоростью передачи информации (по сравнению с линейной топологией) и устойчивостью. Она способна объединить до 1000 устройств. Но, если в какой-либо части кольца пропадает сигнал, система полностью перестает работать.\n\nМногосвязная\n\nСхема построения &amp;amp;amp;amp;quot;Многосвязная&amp;amp;amp;amp;quot;\n\nЭта топология позволяет обмениваться данными на высокой скорости. Плюс при выходе из строя одного из элементов сети вся система продолжает функционировать, и остальные участники не испытывают дискомфорта при работе. Такая конфигурация применяется редко, так как является недешевым удовольствием. Обычно ее используют стратегические объекты, которым важна высокоскоростная и надежная работа системы.\n\nЗвезда\n\nСхема построения &amp;amp;amp;amp;quot;Звезда&amp;amp;amp;amp;quot;\n\nВ этой схеме действует центральный коммутатор либо свитч (хаб), к которому по отдельности на расстоянии не более 100 м подключен каждый компьютер. Топология «звезда» считается самой оптимальной для формирования сети благодаря следующим преимуществам:\n\nминимум кабеля и дополнительных инструментов соединения;\n\nнадежная работа в условиях высокой нагрузки;\n\nбесперебойное функционирование системы при выходе из строя одного из компьютеров или канала связи.\n\nЕстественно, если перестанет работать хаб, все участники системы потеряют соединение.	2025-06-15 15:12:11.577947	\N
\.


--
-- TOC entry 4857 (class 0 OID 16995)
-- Dependencies: 227
-- Data for Name: ratings; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.ratings (id, tutor_id, student_id, rating, created_at) FROM stdin;
\.


--
-- TOC entry 4851 (class 0 OID 16417)
-- Dependencies: 221
-- Data for Name: shared_lectures; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.shared_lectures (code, lecture_id, user_id, created_at) FROM stdin;
\.


--
-- TOC entry 4853 (class 0 OID 16768)
-- Dependencies: 223
-- Data for Name: tutor_verifications; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.tutor_verifications (id, user_id, document_url, status, verified_by, created_at, updated_at) FROM stdin;
1	3	/uploads/documents/1747899532650-183631292-5289737127287977381.jpg	pending	\N	2025-05-22 10:38:52.659057	\N
2	5	/uploads/documents/1747902590564-358758606-5289737127287977381.jpg	approved	7	2025-05-22 11:29:50.571447	2025-05-24 11:33:06.136544
\.


--
-- TOC entry 4865 (class 0 OID 0)
-- Dependencies: 228
-- Name: bookings_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.bookings_id_seq', 12, true);


--
-- TOC entry 4866 (class 0 OID 0)
-- Dependencies: 219
-- Name: notes_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.notes_id_seq', 21, true);


--
-- TOC entry 4867 (class 0 OID 0)
-- Dependencies: 226
-- Name: ratings_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.ratings_id_seq', 1, false);


--
-- TOC entry 4868 (class 0 OID 0)
-- Dependencies: 222
-- Name: tutor_verifications_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.tutor_verifications_id_seq', 2, true);


--
-- TOC entry 4869 (class 0 OID 0)
-- Dependencies: 224
-- Name: tutors_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.tutors_id_seq', 2, true);


--
-- TOC entry 4870 (class 0 OID 0)
-- Dependencies: 217
-- Name: users_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.users_id_seq', 9, true);


-- Completed on 2025-10-13 12:33:05

--
-- PostgreSQL database dump complete
--

